# Pedro's Elite VS Code Extensions
# AI & Intelligence
ms-vscode.vscode-claude-code
github.copilot
github.copilot-chat

# Code Quality & Analysis
usernamehw.errorlens
dbaeumer.vscode-eslint
esbenp.prettier-vscode
rbbit.typescript-hero
wix.vscode-import-cost
christian-kohler.path-intellisense

# Git & Version Control
eamodio.gitlens
mhutchie.git-graph

# Productivity & Navigation
formulahendry.auto-rename-tag
aaron-bond.better-comments
wayou.vscode-todo-highlight
alefragnani.project-manager
adpyke.codesnap

# Styling & UI
bradlc.vscode-tailwindcss
zignd.html-css-class-completion
pranaygp.vscode-css-peek
pkief.material-icon-theme
sdras.night-owl

# Development Tools
rangav.vscode-thunder-client
ritwickdey.liveserver
chakrounanas.turbo-console-log

# Language Support
ms-vscode.vscode-typescript-next
bradlc.vscode-tailwindcss
ms-vscode.vscode-json